src/CFD/OpenFOAM/OpenFOAM-v2206-MUI/tutorials/incompressible/pimpleFoam/RAS/rotatingFanInRoom/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    AMI1
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }

    AMI2
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }

    fan
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    door
    {
        type            fixedValue;
        value           uniform (-0.1 0 0);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    room
    {
        type            noSlip;
    }

    desk
    {
        type            noSlip;
    }
}


// ************************************************************************* //
